Documents/ДопускКРаботам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>ДопускКРаботам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасходыНаСотрудниковОрганизации</xr:Item>
				<xr:Item>InformationRegister.ДопускиКРаботам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДопуска</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДопусковКРаботам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПолучения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРасходов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СпособыОпределенияСрокаДействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>СпособыОпределенияСрокаДействия</Name>
			<Comment>vvv</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОпределяетсяИндивидуально</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РассчитываетсяАвтоматически</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ДопускКРаботам/Forms/ФормаДокумента/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Осуществляет добавление работников и их показателей после завершения подбора
//
&НаСервере
Процедура ЗавершитьПодборСотрудниковДляРаботники(АдресВременногоХранилища)
	
	МассивСотрудников = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	
	НовыеСотрудники = ПолучитьНовыеСотрудники(МассивСотрудников, Объект.Работники);
	
	Если НовыеСотрудники.Количество() > 0 Тогда
		Документ = РеквизитФормыВЗначение("Объект");
		Для Каждого Сотрудник Из НовыеСотрудники Цикл
			НоваяСтрока = Документ.Работники.Добавить();
			НоваяСтрока.Сотрудник = Сотрудник;
			НоваяСтрока.ФизЛицо = Сотрудник.ФизЛицо;
		КонецЦикла;
		ЗначениеВРеквизитФормы(Документ, "Объект");
	КонецЕсли;
	
КонецПроцедуры // ЗавершитьПодборСотрудниковДляПострадавшие

// Формирует структуру параметров для формы подбора
//
// Возвращаемое значение:
// Структура
//
&НаКлиенте 
Функция ПолучитьПараметрыВызоваФормыПодбораСотрудника(ИмяТаблицы, ИмяПоля)
	
	Сотрудники = Новый Соответствие;
	Для Каждого Строка Из Объект[ИмяТаблицы] Цикл
		Сотрудники.Вставить(Строка[ИмяПоля]);
	КонецЦикла;	
	
	Возврат СоздатьПараметрыВызоваФормыПодбораСотрудника(Объект.Организация, Сотрудники)
	
КонецФункции // ПолучитьПараметрыВызоваФормыПодбораСотрудника()

// Формирует структуру параметров для формы подбора
//
// Возвращаемое значение:
// Структура
//
&НаСервереБезКонтекста 
Функция СоздатьПараметрыВызоваФормыПодбораСотрудника(Организация, Сотрудники)
	
	ПараметрыВызова = Новый Структура;
	
	ПараметрыВызова.Вставить("Организация", Организация); 
	ПараметрыВызова.Вставить("АдресВыбранныхСотрудниковВХранилище", ПоместитьВоВременноеХранилище(Сотрудники)); 
	
	Возврат ПараметрыВызова
	
КонецФункции // СоздатьПараметрыВызоваФормыПодбораСотрудника()

&НаСервере
Функция ПолучитьНовыеСотрудники(Сотрудники, ТЧ , имяПоля = "Сотрудник", ПоискПоФизЛицу = Ложь)
	
	НовыеСотрудники = Новый Массив();
	
	Для Каждого Сотрудник Из Сотрудники Цикл
		Если ПоискПоФизЛицу Тогда
			
			Если ТипЗнч(Сотрудник) = ТИП("СправочникСсылка.СотрудникиОрганизаций") И ТЧ.НайтиСтроки(Новый Структура(ИмяПоля, Сотрудник.ФизЛицо)).Количество() = 0 Тогда
				НовыеСотрудники.Добавить(Сотрудник);
			КонецЕсли;	
		Иначе
			Если ТЧ.НайтиСтроки(Новый Структура(ИмяПоля, Сотрудник)).Количество() = 0 Тогда
				НовыеСотрудники.Добавить(Сотрудник);
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	

	Возврат НовыеСотрудники;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ПрочитатьПериодичностьИСрокДопуска()
	
	Если Объект.ВидДопуска.СпособОпределенияСрокаДействия = Перечисления.СпособыОпределенияСрокаДействия.РассчитываетсяАвтоматически Тогда
		ПериодичностьДопуска = Объект.ВидДопуска.Периодичность;
		СрокДопуска = Объект.ВидДопуска.СрокДействия;
	Иначе
		ПериодичностьДопуска = Перечисления.Периодичность.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры // ПрочитатьПериодичностьИСрокДопуска

&НаСервере
Процедура ЗаполнитьРаботниковПоВидуДопускаНаСервере()
		
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьРаботниковПоВидуДопуска();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");

КонецПроцедуры // ЗаполнитьРаботниковПоВидуДопускаНаСервере

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПериодичностьГод = Перечисления.Периодичность.Год;
	ПериодичностьДень = Перечисления.Периодичность.День;
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	Если ДокументОбъект.ЭтоНовый() Тогда
		ЗаполнениеДокументовПереопределяемый.ЗаполнитьШапкуДокумента(ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"));
		Если Параметры.ЗначенияЗаполнения.Свойство("Организация") Тогда
			Если ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения.Организация) Тогда
				ДокументОбъект.Организация = Параметры.ЗначенияЗаполнения.Организация;
			КонецЕсли;
		КонецЕсли;
		ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	Иначе
		ПрочитатьПериодичностьИСрокДопуска();
	КонецЕсли;
	
	// Обработчик подсистемы "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	ВалютаУпрУчета  = Константы.ВалютаУправленческогоУчета.Получить();
	Элементы.РаботникиСтоимостьДопуска.Заголовок =  "Сумма расходов (" + ВалютаУпрУчета.Наименование + ")";
	
КонецПроцедуры // ПриСозданииНаСервере

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ИзмененыДопускиКРаботам", ВыгрузитьКолонкуРаботникиНаСервере());

КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
Процедура ПодборСотрудников(Команда)
	
	Результат = ОткрытьФормуМодально("Справочник.СотрудникиОрганизаций.Форма.ФормаПодбора", ПолучитьПараметрыВызоваФормыПодбораСотрудника("Работники" , "Сотрудник"), ЭтаФорма);
	
	Если Результат <> Неопределено Тогда
		ЗавершитьПодборСотрудниковДляРаботники(Результат);
	КонецЕсли;
	
КонецПроцедуры // ПодборСотрудников

&НаКлиенте
Процедура ЗаполнитьПоВидуДопуска(Команда)
	
	Если Объект.Работники.Количество() > 0 Тогда
		Если Вопрос("Табличная часть будет очищена, продолжить?", РежимДиалогаВопрос.ОКОтмена,, КодВозвратаДиалога.ОК) = КодВозвратаДиалога.ОК Тогда
			Объект.Работники.Очистить();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьРаботниковПоВидуДопускаНаСервере();
	
КонецПроцедуры // ЗаполнитьПоВидуДопуска

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура РаботникиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.СотрудникиОрганизаций") Тогда
				
		СтандартнаяОбработка = Ложь;
	
		Если Объект.Работники.НайтиСтроки(Новый Структура("Сотрудник", ВыбранноеЗначение)).Количество() = 0 Тогда
			НоваяСтрока = Объект.Работники.Добавить();
			НоваяСтрока.Сотрудник = ВыбранноеЗначение;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // РаботникиОбработкаВыбора

&НаКлиенте
Процедура РаботникиДатаПолученияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Работники.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		Если ПериодичностьДопуска = ПериодичностьГод Тогда
			ТекущиеДанные.СрокДействия = ДобавитьМесяц(ТекущиеДанные.ДатаПолучения, СрокДопуска * 12);
		ИначеЕсли ПериодичностьДопуска = ПериодичностьДень Тогда
			ТекущиеДанные.СрокДействия = ДобавитьМесяц(ТекущиеДанные.ДатаПолучения, СрокДопуска);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // РаботникиДатаПолученияПриИзменении

&НаКлиенте
Процедура ВидДопускаПриИзменении(Элемент)
	
	ПрочитатьПериодичностьИСрокДопуска();
	
КонецПроцедуры // ВидДопускаПриИзменении

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция ВыгрузитьКолонкуРаботникиНаСервере()
	
	Возврат ОбщегоНазначения.ВыгрузитьКолонку(Объект.Работники, "Сотрудник");
	
КонецФункции
